content/emacs/configs/04-window.org
#+title: Window Management
#+AUTHOR: Kyeong Soo Choi
#+STARTUP: overview
#+OPTIONS: toc:2 num:3
#+PROPERTY: header-args:emacs-lisp :mkdirp yes :results none

Configuration for window splitting, sizing, and navigation.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/window-conf.el
  ;;; window-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (use-package window
    :ensure nil
    :custom
    (display-buffer-alist
     '(
  	 ;; ("\\*.*e?shell\\*"
  	 ;;  (display-buffer-in-side-window)
  	 ;;  (window-height . 0.25)
  	 ;;  (side . bottom)
  	 ;;  (slot . -1))
  	 ("\\*\\(Backtrace\\|Warnings\\|Compile-Log\\|Messages\\|Bookmark List\\|Occur\\|eldoc\\)\\*"
  	  (display-buffer-in-side-window)
  	  (window-height . 0.25)
  	  (side . bottom)
  	  (slot . 0))
  	 ("\\*\\([Hh]elp\\)\\*"
  	  (display-buffer-in-side-window)
  	  (window-width . 75)
  	  (side . right)
  	  (slot . 0))
  	 ("\\*\\(Ibuffer\\)\\*"
  	  (display-buffer-in-side-window)
  	  (window-width . 100)
  	  (side . right)
  	  (slot . 1))
  	 ("\\*\\(Flymake diagnostics\\|xref\\|Completions\\)"
  	  (display-buffer-in-side-window)
  	  (window-height . 0.25)
  	  (side . bottom)
  	  (slot . 1))
  	 ("\\*\\(grep\\|find\\)\\*"
  	  (display-buffer-in-side-window)
  	  (window-height . 0.25)
  	  (side . bottom)
  	  (slot . 2))
  	 )))
  (provide 'window-conf)
  ;;; window-conf.el ends here
#+end_src

